Autodesk.Revit.DB.Architecture.PostPattern.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Architecture.PostPattern.CornerPostCondition
The condition which controls the insertion of corner posts.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2019

Autodesk.Revit.DB.Architecture.PostPattern.CornerPostAngle
The angle between neighboring railing segments which conditions inserting post along a railing path.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The given value for cornerPostAngle is not finite
Since:
2019

Autodesk.Revit.DB.Architecture.PostPattern.CornerPost
Accesses the object containing properties related to the corner post.
Since:
2019

Autodesk.Revit.DB.Architecture.PostPattern.EndPost
Accesses the object containing properties related to the end post.
Since:
2019

Autodesk.Revit.DB.Architecture.PostPattern.StartPost
Accesses the object containing properties related to the start post.
Since:
2019

Autodesk.Revit.DB.Architecture.PostPattern
Post pattern class.
Since:
2019